---
type: Macro
namespace: Autodesk.Revit.DB.Macros
version: 2024
members: 6
tags: [revit-api, class]
---

# Macro

`Autodesk.Revit.DB.Macros.Macro` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Execute | 2014 | `public void Execute ()` |
| Property | Description | 2014 | `public string Description { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MacroModule | 2014 | `public MacroModule MacroModule { get ; }` |
| Property | Name | 2014 | `public string Name { get ; }` |